; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p6---int100n150-m25---int100c110---s68---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level8 level8)
(sum level0 level15 level15)
(sum level0 level18 level18)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level1 level4 level5)
(sum level1 level8 level9)
(sum level1 level15 level16)
(sum level1 level18 level19)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level2 level4 level6)
(sum level2 level8 level10)
(sum level2 level15 level17)
(sum level2 level18 level20)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level3 level4 level7)
(sum level3 level8 level11)
(sum level3 level15 level18)
(sum level3 level18 level21)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level4 level4 level8)
(sum level4 level8 level12)
(sum level4 level15 level19)
(sum level4 level18 level22)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level5 level4 level9)
(sum level5 level8 level13)
(sum level5 level15 level20)
(sum level5 level18 level23)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level6 level4 level10)
(sum level6 level8 level14)
(sum level6 level15 level21)
(sum level6 level18 level24)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level7 level4 level11)
(sum level7 level8 level15)
(sum level7 level15 level22)
(sum level7 level18 level25)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level8 level4 level12)
(sum level8 level8 level16)
(sum level8 level15 level23)
(sum level8 level18 level26)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level9 level4 level13)
(sum level9 level8 level17)
(sum level9 level15 level24)
(sum level9 level18 level27)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level10 level4 level14)
(sum level10 level8 level18)
(sum level10 level15 level25)
(sum level10 level18 level28)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level11 level4 level15)
(sum level11 level8 level19)
(sum level11 level15 level26)
(sum level11 level18 level29)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level12 level4 level16)
(sum level12 level8 level20)
(sum level12 level15 level27)
(sum level12 level18 level30)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level13 level4 level17)
(sum level13 level8 level21)
(sum level13 level15 level28)
(sum level13 level18 level31)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level14 level4 level18)
(sum level14 level8 level22)
(sum level14 level15 level29)
(sum level14 level18 level32)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level15 level4 level19)
(sum level15 level8 level23)
(sum level15 level15 level30)
(sum level15 level18 level33)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level16 level4 level20)
(sum level16 level8 level24)
(sum level16 level15 level31)
(sum level16 level18 level34)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level17 level4 level21)
(sum level17 level8 level25)
(sum level17 level15 level32)
(sum level17 level18 level35)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level18 level4 level22)
(sum level18 level8 level26)
(sum level18 level15 level33)
(sum level18 level18 level36)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level19 level4 level23)
(sum level19 level8 level27)
(sum level19 level15 level34)
(sum level19 level18 level37)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level20 level4 level24)
(sum level20 level8 level28)
(sum level20 level15 level35)
(sum level20 level18 level38)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level21 level4 level25)
(sum level21 level8 level29)
(sum level21 level15 level36)
(sum level21 level18 level39)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level22 level4 level26)
(sum level22 level8 level30)
(sum level22 level15 level37)
(sum level22 level18 level40)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level23 level4 level27)
(sum level23 level8 level31)
(sum level23 level15 level38)
(sum level23 level18 level41)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level24 level4 level28)
(sum level24 level8 level32)
(sum level24 level15 level39)
(sum level24 level18 level42)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level25 level4 level29)
(sum level25 level8 level33)
(sum level25 level15 level40)
(sum level25 level18 level43)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level26 level4 level30)
(sum level26 level8 level34)
(sum level26 level15 level41)
(sum level26 level18 level44)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level27 level4 level31)
(sum level27 level8 level35)
(sum level27 level15 level42)
(sum level27 level18 level45)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level28 level4 level32)
(sum level28 level8 level36)
(sum level28 level15 level43)
(sum level28 level18 level46)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level29 level4 level33)
(sum level29 level8 level37)
(sum level29 level15 level44)
(sum level29 level18 level47)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level30 level4 level34)
(sum level30 level8 level38)
(sum level30 level15 level45)
(sum level30 level18 level48)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level31 level4 level35)
(sum level31 level8 level39)
(sum level31 level15 level46)
(sum level31 level18 level49)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level32 level4 level36)
(sum level32 level8 level40)
(sum level32 level15 level47)
(sum level32 level18 level50)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level33 level4 level37)
(sum level33 level8 level41)
(sum level33 level15 level48)
(sum level33 level18 level51)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level34 level4 level38)
(sum level34 level8 level42)
(sum level34 level15 level49)
(sum level34 level18 level52)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level35 level4 level39)
(sum level35 level8 level43)
(sum level35 level15 level50)
(sum level35 level18 level53)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level36 level4 level40)
(sum level36 level8 level44)
(sum level36 level15 level51)
(sum level36 level18 level54)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level37 level4 level41)
(sum level37 level8 level45)
(sum level37 level15 level52)
(sum level37 level18 level55)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level38 level4 level42)
(sum level38 level8 level46)
(sum level38 level15 level53)
(sum level38 level18 level56)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level39 level4 level43)
(sum level39 level8 level47)
(sum level39 level15 level54)
(sum level39 level18 level57)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level40 level4 level44)
(sum level40 level8 level48)
(sum level40 level15 level55)
(sum level40 level18 level58)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level41 level4 level45)
(sum level41 level8 level49)
(sum level41 level15 level56)
(sum level41 level18 level59)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level42 level4 level46)
(sum level42 level8 level50)
(sum level42 level15 level57)
(sum level42 level18 level60)
(sum level42 level20 level62)
(sum level42 level21 level63)
(sum level43 level4 level47)
(sum level43 level8 level51)
(sum level43 level15 level58)
(sum level43 level18 level61)
(sum level43 level20 level63)
(sum level43 level21 level64)
(sum level44 level4 level48)
(sum level44 level8 level52)
(sum level44 level15 level59)
(sum level44 level18 level62)
(sum level44 level20 level64)
(sum level44 level21 level65)
(sum level45 level4 level49)
(sum level45 level8 level53)
(sum level45 level15 level60)
(sum level45 level18 level63)
(sum level45 level20 level65)
(sum level45 level21 level66)
(sum level46 level4 level50)
(sum level46 level8 level54)
(sum level46 level15 level61)
(sum level46 level18 level64)
(sum level46 level20 level66)
(sum level46 level21 level67)
(sum level47 level4 level51)
(sum level47 level8 level55)
(sum level47 level15 level62)
(sum level47 level18 level65)
(sum level47 level20 level67)
(sum level47 level21 level68)
(sum level48 level4 level52)
(sum level48 level8 level56)
(sum level48 level15 level63)
(sum level48 level18 level66)
(sum level48 level20 level68)
(sum level49 level4 level53)
(sum level49 level8 level57)
(sum level49 level15 level64)
(sum level49 level18 level67)
(sum level50 level4 level54)
(sum level50 level8 level58)
(sum level50 level15 level65)
(sum level50 level18 level68)
(sum level51 level4 level55)
(sum level51 level8 level59)
(sum level51 level15 level66)
(sum level52 level4 level56)
(sum level52 level8 level60)
(sum level52 level15 level67)
(sum level53 level4 level57)
(sum level53 level8 level61)
(sum level53 level15 level68)
(sum level54 level4 level58)
(sum level54 level8 level62)
(sum level55 level4 level59)
(sum level55 level8 level63)
(sum level56 level4 level60)
(sum level56 level8 level64)
(sum level57 level4 level61)
(sum level57 level8 level65)
(sum level58 level4 level62)
(sum level58 level8 level66)
(sum level59 level4 level63)
(sum level59 level8 level67)
(sum level60 level4 level64)
(sum level60 level8 level68)
(sum level61 level4 level65)
(sum level62 level4 level66)
(sum level63 level4 level67)
(sum level64 level4 level68)

(connected l0 l1)
(fuelcost level20 l0 l1)
(connected l0 l3)
(fuelcost level8 l0 l3)
(connected l0 l4)
(fuelcost level20 l0 l4)
(connected l1 l0)
(fuelcost level20 l1 l0)
(connected l1 l2)
(fuelcost level18 l1 l2)
(connected l1 l4)
(fuelcost level15 l1 l4)
(connected l2 l1)
(fuelcost level18 l2 l1)
(connected l2 l3)
(fuelcost level4 l2 l3)
(connected l2 l4)
(fuelcost level21 l2 l4)
(connected l3 l0)
(fuelcost level8 l3 l0)
(connected l3 l2)
(fuelcost level4 l3 l2)
(connected l4 l0)
(fuelcost level20 l4 l0)
(connected l4 l1)
(fuelcost level15 l4 l1)
(connected l4 l2)
(fuelcost level21 l4 l2)

(at t0 l3)
(fuel t0 level68)
(= (total-cost) 0)

(at p0 l4)
(at p1 l2)
(at p2 l4)
(at p3 l4)
(at p4 l3)
(at p5 l3)
)

(:goal
(and
(at p0 l3)
(at p1 l4)
(at p2 l1)
(at p3 l1)
(at p4 l4)
(at p5 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 6
2. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 6
3. (drive t0 l3 l2 level64 level4 level68)
   deleted: (at t0 l3) (fuel t0 level68)
   added: (at t0 l2) (fuel t0 level64)
   goals met: 0 of 6
4. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 6
5. (drive t0 l2 l4 level43 level21 level64)
   deleted: (at t0 l2) (fuel t0 level64)
   added: (at t0 l4) (fuel t0 level43)
   goals met: 0 of 6
6. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 0 of 6
7. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 0 of 6
8. (load p3 t0 l4)
   deleted: (at p3 l4)
   added: (in p3 t0)
   goals met: 0 of 6
9. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 1 of 6
10. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 2 of 6
11. (drive t0 l4 l1 level28 level15 level43)
   deleted: (at t0 l4) (fuel t0 level43)
   added: (at t0 l1) (fuel t0 level28)
   goals met: 2 of 6
12. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 6
13. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 4 of 6
14. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 5 of 6
15. (drive t0 l1 l0 level8 level20 level28)
   deleted: (at t0 l1) (fuel t0 level28)
   added: (at t0 l0) (fuel t0 level8)
   goals met: 5 of 6
16. (drive t0 l0 l3 level0 level8 level8)
   deleted: (at t0 l0) (fuel t0 level8)
   added: (at t0 l3) (fuel t0 level0)
   goals met: 5 of 6
17. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 6 of 6
